This is happening to me too.
if I run the plan without any import on the code I get
```
 # module.zone.cloudflare_record.default["api-CNAME-example.com"] will be created
  + resource "cloudflare_record" "default" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "api"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "example.com"
      + zone_id         = "yyyyyyyyxxxxxxxxxxxxxzzzzzz"
    }

```
Then, after getting the IDs using `cf-terraforming` 
```
❯ cf-terraforming import --email $CLOUDFLARE_EMAIL --token $CLOUDFLARE_API_TOKEN -z yyyyyyyyxxxxxxxxxxxxxzzzzzz --resource-type cloudflare_record
terraform import cloudflare_record.terraform_managed_resource_123456789bla yyyyyyyyxxxxxxxxxxxxxzzzzzz/123456789bla
```
and adding the import block accordingly
```
import {
  to = module.zone.cloudflare_record.default["api-CNAME-example.com"]
  id = "yyyyyyyyxxxxxxxxxxxxxzzzzzz/123456789bla"
}
```
I get the same plan as if nothing had been added
